-- Active: 1697233781638@@127.0.0.1@3306@library
USE library;
/*
INSERT INTO authors (id, authorsname, bearthday)
VALUES (1, 'Александр Пушкин', '1799-06-06'),
       (2, 'Фёдор Достоевский', '1821-11-11'),
       (3, 'Лев Толстой', '1828-09-09'),
       (4, 'Михаил Булгаков', '1891-05-15'),
       (5, 'Иван Тургенев', '1818-10-09');
*/
/*
INSERT INTO books (id, writingtime, bookname, author, pagecount) VALUES 
(1, '1833-05-07', 'Евгений Онегин', 'Александр Пушкин', 500),
(2, '1866-10-19', 'Преступление и наказание', 'Фёдор Достоевский', 574),
(3, '1812-07-12', 'Война и мир', 'Лев Толстой', 1300),
(4, '1940-02-21', 'Мастер и Маргарита', 'Михаил Булгаков', 2000),
(5, '1860-06-02', 'Отцы и дети', 'Иван Тургенев', 288);
*/
/*
INSERT INTO orders (id, orderer, bookinorder, count, orderdate, givendate) VALUES 
(1, 'Иванов', 'Евгений Онегин', 2, '2021-03-25', '2021-03-27'),
(2, 'Петров', 'Преступление и наказание', 1, '2021-03-26', '2021-03-28'),
(3, 'Сидоров', 'Война и мир', 3, '2021-03-27', '2021-03-30'),
(4, 'Козлов', 'Мастер и Маргарита', 2, '2021-03-28', '2021-04-01'),
(5, 'Смирнов', 'Отцы и дети', 1, '2021-03-29', '2021-04-02');
*/
SELECT * FROM orders